[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:3:46
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ArticlesCreatePage() {
-
-  // Stryker disable all : articles for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function ArticlesCreatePage() {}
 
killedBy: ArticlesCreatePage tests Renders expected content
statusReason: Error: ArticlesCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
