[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:11:20
 export default function ArticlesTable({
     articles,
     currentUser,
-    testIdPrefix = "ArticlesTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: ArticlesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:38:21
         },
 
         {
-            Header: 'Title',
+            Header: "",
             accessor: 'title',
         },
killedBy: ArticlesTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:41:9
             Header: 'Title',
             accessor: 'title',
         },
-        {
-            Header: 'Url',
-            accessor: 'url',
-        },
+        {},
         {
             Header: 'Explanation',
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
