[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.js:9:31
 
 export default function ArticlesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (articles) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.js:9:46
 
 export default function ArticlesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (articles) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: articles.title,
-      url: articles.url,
-      explanation: articles.explanation,
-      email: articles.email,
-      dateAdded: articles.dateAdded,
-    }
-  });
+  const objectToAxiosParams = (articles) => ({});
 
   const onSuccess = (articles) => {
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:21:35
     }
   });
 
-  const onSuccess = (articles) => {
-    toast(`New Articles Created - id: ${articles.id} title: ${articles.title}`);
-  }
+  const onSuccess = (articles) => {}
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Articles Created - id: 3 title: Learn CS Now"

Number of calls: 0
