[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/articles/create"
-                    style={{ float: "right" }}
-                >
-                    Create Article
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.js:23:49
         );
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/articles/create"
-                    style={{ float: "right" }}
-                >
-                    Create Article
-                </Button>
-            )
-        } 
+        if (hasRole(currentUser, "ROLE_ADMIN")) {} 
     }
 
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Article/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
