[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:33:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:33:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">id</Form.Label>
+                            <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:147:42
                             id="solved"
                             type="switch"
                             label="Solved?"
-                            {...register("solved", {})}
+                            {...register("", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
