[Killed] StringLiteral
src/main/utils/MenuItemReviewUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/menuitemreviews",
+        url: "",
         method: "DELETE",
         params: {
killedBy: MenuItemReviewUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {
