[Killed] StringLiteral
main/components/Organizations/OrganizationsForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "OrganizationsForm";
+  const testIdPrefix = "";
 
   return (
killedBy: OrganizationForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="OrganizationsForm-orgCode"]

<body>
  <div>
    <form
      class=""
    >
      <div
