[Killed] BlockStatement
main/components/Organizations/OrganizationsTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`ucsborganizations/edit/${cell.row.values.orgCode}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: OrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ucsborganizations/edit/EWB"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Organizations/OrganizationsTable.js:17:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`ucsborganizations/edit/${cell.row.values.orgCode}`)
+        navigate(``)
     }
 
killedBy: OrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "ucsborganizations/edit/EWB"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Organizations/OrganizationsTable.js:43:21
             accessor: 'orgTranslationShort',
         },
         {
-            Header: 'Organization Name Full',
+            Header: "",
             accessor: 'orgTranslation',
         },
killedBy: OrganizationTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Organization Name Full. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
