[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (organization) => ({
-    url: "/api/ucsborganizations/post",
-    method: "POST",
-    params: {
-     orgCode: organization.orgCode,
-     orgTranslationShort: organization.orgTranslationShort,
-     orgTranslation: organization.orgTranslation,
-     inactive: organization.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (organization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganizations
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
