[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:56:52
                             id="itemId"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true })}
+                            {...register("itemId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:59:30
                             {...register("itemId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.itemId && 'ItemId is required.'}
+                            {errors.itemId || 'ItemId is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Id/

Here are the matching elements:

<label
  class="form-label"
  for="id"
>

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:59:30
                             {...register("itemId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.itemId && 'ItemId is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:130:54
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", {
-                                required: "Comment is required."
-                            })}
+                            {...register("comments", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comment is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
